---
kind: type
id: T:Autodesk.Revit.DB.PerformanceAdviserRuleId
source: html/3cd02844-a37b-9a93-e926-7d7f32450839.htm
---
# Autodesk.Revit.DB.PerformanceAdviserRuleId

The unique identifier of a PerformanceAdviserRule

## Syntax (C#)
```csharp
public class PerformanceAdviserRuleId : GuidEnum
```

## Remarks
Each performance adviser rule registered in application must be given a unique id
 that can be used to identify and unregister rule later.